app/Controllers/Form.php

    public function index()
    {
        $model = new FormModel();
        $data['forms'] = $model->findAll();
---
SELECT *
FROM `forms`

    public function view($id)
    {
        $model = new FormModel();

        // Validate id: we expect a numeric primary key. If it's not numeric,
        // return to the listing with an error message so the user can choose
        // a valid record. This prevents the 404 route error when a bad link
        // like "form/view/form" is requested.
        if (!is_numeric($id)) {
            $data['forms'] = $model->findAll();
            $data['error'] = 'Invalid record selected.';
            return view('form_page', $data);
        }

        $data['form'] = $model->find($id);
---
SELECT *
FROM `forms`
WHERE `forms`.`id` = '7'

    public function recent()
    {
        try {
            $model = new FormModel();
            $forms = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `forms`
ORDER BY `id` DESC